/*
 *Copyright (c)2006-2008 Trusted Logic S.A.
 *All Rights Reserved.
 *
 *This program is free software; you can redistribute it and/or
 *modify it under the terms of the GNU General Public License
 *version 2 as published by the Free Software Foundation.
 *
 *This program is distributed in the hope that it will be useful,
 *but WITHOUT ANY WARRANTY; without even the implied warranty of
 *MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 *GNU General Public License for more details.
 *
 *You should have received a copy of the GNU General Public License
 *along with this program; if not, write to the Free Software
 *Foundation, Inc., 59 Temple Place, Suite 330, Boston,
 *MA 02111-1307 USA
 */

#include "scxlnx_defs.h"
#include "scxlnx_util.h"
#include "scx_public_crypto.h"
#include "scx_public_dma.h"

#include <linux/crypto.h>
#include <linux/scatterlist.h>
#include <crypto/algapi.h>
#include <crypto/scatterwalk.h>
#include <crypto/aes.h>

/*
 *AES Hardware Accelerator: Base address
 */
#define AES1_REGS_HW_ADDR		0x480A6000

/*
 *CTRL register Masks
 */
#define AES_CTRL_OUTPUT_READY_BIT	(1<<0)
#define AES_CTRL_INPUT_READY_BIT		(1<<1)

#define AES_CTRL_GET_DIRECTION(x)	(x&4)
#define AES_CTRL_DIRECTION_DECRYPT	0
#define AES_CTRL_DIRECTION_ENCRYPT	(1<<2)

#define AES_CTRL_GET_KEY_SIZE(x)		(x&0x18)
#define AES_CTRL_KEY_SIZE_128			0x08
#define AES_CTRL_KEY_SIZE_192			0x10
#define AES_CTRL_KEY_SIZE_256			0x18

#define AES_CTRL_GET_MODE(x)			((x&0x60) >> 5)
#define AES_CTRL_IS_MODE_CBC(x)		(AES_CTRL_GET_MODE(x) == 1)
#define AES_CTRL_IS_MODE_ECB(x)		(AES_CTRL_GET_MODE(x) == 0)
#define AES_CTRL_IS_MODE_CTR(x)		((AES_CTRL_GET_MODE(x) == 2) || \
					(AES_CTRL_GET_MODE(x) == 3))
#define AES_CTRL_MODE_CBC_BIT			0x20
#define AES_CTRL_MODE_ECB_BIT			0
#define AES_CTRL_MODE_CTR_BIT			0x40

#define AES_CTRL_GET_CTR_WIDTH(x)	(x&0x180)
#define AES_CTRL_CTR_WIDTH_32			0
#define AES_CTRL_CTR_WIDTH_64			0x80
#define AES_CTRL_CTR_WIDTH_96			0x100
#define AES_CTRL_CTR_WIDTH_128		0x180

/*
 *MASK register masks
 */
#define AES_MASK_AUTOIDLE_BIT			(1<<0)
#define AES_MASK_SOFTRESET_BIT		(1<<1)
#define AES_MASK_DMA_REQ_IN_EN_BIT	(1<<2)
#define AES_MASK_DMA_REQ_OUT_EN_BIT	(1<<3)
#define AES_MASK_DIRECT_BUS_EN_BIT	(1<<4)
#define AES_MASK_START_BIT				(1<<5)

#define AES_MASK_GET_SIDLE(x)			((x&0xC0) >> 6)
#define AES_MASK_SIDLE_FORCE_IDLE	0
#define AES_MASK_SIDLE_NO_IDLE		1
#define AES_MASK_SIDLE_SMART_IDLE	2

/*
 *SYSTATUS register masks
 */
#define AES_SYSTATUS_RESET_DONE		(1<<0)

/*----------------------------------------------------------------------*/
/*			 AES Context					*/
/*----------------------------------------------------------------------*/
/**
 *This structure contains the registers of the AES HW accelerator.
 */
typedef struct {
	VU32 AES_KEY4_L;	/*0x00 */
	VU32 AES_KEY4_H;	/*0x04 */
	VU32 AES_KEY3_L;	/*0x08 */
	VU32 AES_KEY3_H;	/*0x0C */
	VU32 AES_KEY2_L;	/*0x10 */
	VU32 AES_KEY2_H;	/*0x14 */
	VU32 AES_KEY1_L;	/*0x18 */
	VU32 AES_KEY1_H;	/*0x1c */

	VU32 AES_IV_1;		/*0x20 */
	VU32 AES_IV_2;		/*0x24 */
	VU32 AES_IV_3;		/*0x28 */
	VU32 AES_IV_4;		/*0x2C */

	VU32 AES_CTRL;		/*0x30 */

	VU32 AES_DATA_1;	/*0x34 */
	VU32 AES_DATA_2;	/*0x38 */
	VU32 AES_DATA_3;	/*0x3C */
	VU32 AES_DATA_4;	/*0x40 */

	VU32 AES_REV;		/*0x44 */
	VU32 AES_MASK;		/*0x48 */

	VU32 AES_SYSSTATUS;	/*0x4C */

} AESReg_t;

#define FLAGS_FAST	BIT(7)
#define FLAGS_BUSY	8

typedef struct {
	unsigned long		flags;

	spinlock_t		lock;
	struct crypto_queue	queue;

	struct tasklet_struct	task;

	struct ablkcipher_request	*req;
	size_t				total;
	struct scatterlist		*in_sg;
	size_t				in_offset;
	struct scatterlist		*out_sg;
	size_t				out_offset;

	size_t			buflen;
	void			*buf_in;
	size_t			dma_size;
	int			dma_in;
	int			dma_lch_in;
	dma_addr_t		dma_addr_in;
	void			*buf_out;
	int			dma_out;
	int			dma_lch_out;
	dma_addr_t		dma_addr_out;

	PUBLIC_CRYPTO_AES_OPERATION_STATE *ctx;
} AES_HWA_CTX;
static AES_HWA_CTX *aes_ctx;

/*---------------------------------------------------------------------------
 *Forward declarations
 *------------------------------------------------------------------------- */

static void PDrvCryptoUpdateAESWithDMA(u8 *pSrc, u8 *pDest,
					u32 nbBlocks, u32 dmaUse);

